tap "charmbracelet/tap"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "itome/tap"
tap "kaito-swiftformat/taps"
tap "leoafarias/fvm"
tap "nektos/tap"
tap "nikitabobko/tap"
tap "railwaycat/emacsmacport"
tap "shotakashihara/tap"
tap "skiptools/skip"
tap "swiftwasm/tap"
tap "xcodesorg/made"
brew "act"
brew "bat"
brew "carthage"
brew "ccls"
brew "librsvg"
brew "chafa"
brew "circleci"
brew "cmake"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "gtk+3"
brew "kotlin"
brew "lazygit"
brew "lua"
brew "lua-language-server"
brew "marksman"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "nodebrew"
brew "pipx"
brew "powerlevel10k"
brew "progressline"
brew "rbenv"
brew "ripgrep"
brew "rustup"
brew "sccache"
brew "swiftformat"
brew "swiftlint"
brew "thefuck"
brew "tree"
brew "vapor"
brew "wget"
brew "xcbeautify"
brew "xcode-build-server"
brew "charmbracelet/tap/freeze"
brew "itome/tap/flx"
brew "leoafarias/fvm/fvm"
brew "shotakashihara/tap/accs"
brew "swiftwasm/tap/carton"
cask "aerospace"
cask "android-platform-tools"
cask "apple-juice"
cask "emacs"
cask "font-hack-nerd-font"
cask "iterm2"
cask "pomotroid"
cask "skip"
cask "warp"
cask "xcodes"
vscode "astro-build.astro-vscode"
vscode "astro-build.houston"
vscode "bierner.markdown-preview-github-styles"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "github.remotehub"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "ritwickdey.liveserver"
vscode "sswg.swift-lang"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
