cask_args appdir: "/Applications"

# Tap
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "kaito-swiftformat/taps"
tap "nektos/tap"
tap "skiptools/skip"
tap "swiftwasm/tap"
tap "xcodesorg/made"

# brew
brew "act"
brew "bat"
brew "chafa"
brew "cmake"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "gtk+3"
brew "libxml2"
brew "lua"
brew "lua-language-server"
brew "marksman"
brew "neovim"
brew "ninja"
brew "nodebrew"
brew "powerlevel10k"
brew "rbenv"
brew "ripgrep"
brew "rustup-init"
brew "sccache"
brew "swiftformat"
brew "swiftlint"
brew "task"
brew "thefuck"
brew "tree"
brew "vapor"
brew "xcbeautify"
brew "xcode-build-server"
brew "swiftwasm/tap/carton"

# cask
cask "android-platform-tools"
cask "font-hack-nerd-font"
cask "iterm2"
cask "skip"
cask "xcodes"

# vscode
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "mateocerquetella.xcode-12-theme"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.vscode-typescript-next"
vscode "pulkitgangwar.nextjs-snippets"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "sswg.swift-lang"
vscode "stevemoser.xcode-keybindings"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "xabikos.javascriptsnippets"
