cask_args appdir: "/Applications"

# Tap
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "kaito-swiftformat/taps"
tap "nektos/tap"
tap "skiptools/skip"
tap "swiftwasm/tap"
tap "xcodesorg/made"

# brew
brew "accs"
brew "act"
brew "bat"
brew "chafa"
brew "cmake"
brew "ccls"
brew "eza"
brew "fontconfig"
brew "freeze"
brew "fvm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "glib"
brew "glow"
brew "gtk+3"
brew "libxml2"
brew "lua"
brew "lua-language-server"
brew "marksman"
brew "neovim"
brew "ninja"
brew "nodebrew"
brew "powerlevel10k"
brew "rbenv"
brew "ripgrep"
brew "rustup-init"
brew "sccache"
brew "swiftformat"
brew "swiftlint"
brew "task"
brew "thefuck"
brew "tree"
brew "vapor"
brew "xcbeautify"
brew "xcode-build-server"
brew "swiftwasm/tap/carton"

# cask
cask "android-platform-tools"
cask "font-hack-nerd-font"
cask "iterm2"
cask "skip"
cask "xcodes"
